       IDENTIFICATION DIVISION.
       PROGRAM-ID.    HELLO-WORLD.
       AUTHOR.        GERRIT GIEHL.
       DATE-WRITTEN.  01/01/2014.
       DATE-COMPILED. 01/01/2014.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 BLACK   CONSTANT AS 0.
       01 BLUE    CONSTANT AS 1.
       01 GREEN   CONSTANT AS 2.
       01 CYAN    CONSTANT AS 3.
       01 RED     CONSTANT AS 4.
       01 MAGENTA CONSTANT AS 5.
       01 BROWN   CONSTANT AS 6.
       01 WHITE   CONSTANT AS 7.

       01 ENTRY-FIELD-COLOR CONSTANT AS RED.

       01   WS-STORED-AREAS.       
	05  FIRST-NAME PIC X(25).
	05  LAST-NAME  PIC X(25).

       SCREEN SECTION.
       01  BLANK-SCREEN.
        05  FILLER LINE 1 BLANK SCREEN BACKGROUND-COLOR BLACK.

       01  START-SCREEN.
        05  BLANK SCREEN BACKGROUND-COLOR BLACK FOREGROUND-COLOR WHITE.
      	05  VALUE "DATA ENTRY SCREEN" BLANK SCREEN     LINE 1 COL 35.
        05  VALUE "ID #"                               LINE 3 COL 10.
        05  VALUE "C - TO CONTINUE"                    LINE 11 COL 30.
        05  VALUE "Q - TO QUIT"                        LINE 12 COL 30.
        05  VALUE "ENTER RESPONSE"                     LINE 14 COL 30.
	
       01  DATA-ENTRY-SCREEN.
	05  VALUE "FIRST NAME:"                          LINE 2 COL 5.
	05  SCREEN-FIRST-NAME PIC X(25) USING FIRST-NAME LINE 2 COL 17
	    FOREGROUND-COLOR ENTRY-FIELD-COLOR.
	05  VALUE "LAST NAME :"                          LINE 3 COL 5.
	05  SCREEN-LAST-NAME PIC X(25) USING LAST-NAME   LINE 3 COL 17
            FOREGROUND-COLOR ENTRY-FIELD-COLOR.

       PROCEDURE DIVISION.
       DISPLAY BLANK-SCREEN.
       
      * PERFORM UNTIL START-SCREEN NOT EQUAL "Q"
      *   DISPLAY START-SCREEN
      *   ACCEPT START-SCREEN
      * END-PERFORM.
      * STOP RUN.
	 
       SCREEN-LOOP.
         DISPLAY DATA-ENTRY-SCREEN.
         ACCEPT DATA-ENTRY-SCREEN.

         IF FIRST-NAME(1:1) NOT EQUAL "Q"
           GO TO SCREEN-LOOP.
         ELSE-IF.
    
       STOP RUN.
      * GOBACK.
      * END PROGRAM HELLO-WORLD.


       